========================================
      OVERALL RECAP OF THE MODEL        
========================================

---------------------------------------------
>>     Parameters     <<

> DATA_PATH:             /home/bastien/Bureau/Valides_5-5/
> MODEL_NAME:            dense_1
> BOOL_COLLISION_ONLY:   False
> TIME_WINDOW_SIZE:      30
> OVERLAP_RATIO:         0.5
> BATCH_SIZE:            128
> EPOCHS:                5
> TEST_SIZE:             0.3
> IA_NUMBER:             0
---------------------------------------------

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  48100     
_________________________________________________________________
dense_1 (Dense)              multiple                  10100     
_________________________________________________________________
dense_2 (Dense)              multiple                  10100     
_________________________________________________________________
dense_3 (Dense)              multiple                  404       
=================================================================
Total params: 68,704
Trainable params: 68,704
Non-trainable params: 0
_________________________________________________________________

False predictions: 6510/14915
Pred: [3 1 3 ... 3 3 3]
Real: [1 3 2 ... 1 2 1]
