_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  multiple                  1091584   
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  32772     
=================================================================
Total params: 1,124,356
Trainable params: 1,124,356
Non-trainable params: 0
_________________________________________________________________
